{"meta":{"title":"吕小白的博客","subtitle":null,"description":"What we think, we become.","author":"Colin","url":"http://colink.tech"},"pages":[{"title":"关于我","date":"2017-04-06T07:44:33.000Z","updated":"2017-04-06T07:58:05.000Z","comments":true,"path":"about/index.html","permalink":"http://colink.tech/about/index.html","excerpt":"","text":"我爱学习，学习爱我。 小白一枚，请多关照。"},{"title":"所有分类","date":"2017-02-22T13:32:43.000Z","updated":"2017-02-23T13:01:34.000Z","comments":false,"path":"categories/index.html","permalink":"http://colink.tech/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2017-02-22T13:28:02.000Z","updated":"2017-02-23T13:03:01.000Z","comments":false,"path":"tags/index.html","permalink":"http://colink.tech/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Mac下搭建Hadoop-1.2.1调试环境","slug":"Mac下搭建Hadoop-1-2-1调试环境","date":"2017-04-30T06:39:26.000Z","updated":"2017-04-30T08:39:46.000Z","comments":true,"path":"2017/04/30/Mac下搭建Hadoop-1-2-1调试环境/","link":"","permalink":"http://colink.tech/2017/04/30/Mac下搭建Hadoop-1-2-1调试环境/","excerpt":"","text":"本机环境 macOS Sierra (version 10.12.4) Java 1.8.0_121 Hadoop-1.2.1 IntelliJ IDEA (Community Edition) 准备工作 下载Hadoop-1.2.1源代码。比如这里 解压: tar -zxvf hadoop-1.2.1.tar.gz 用IntelliJ导入 Import Project ​ Create project from existing sources ​ 一路Next点下去 右键build.xml并Add as Ant Build File ​ 找到src/mapred/org/apache/hadoop/mapreduce/lib/partittion/InputSampler改一行代码 1K[] samples = (K[]) sampler.getSample(inf, job); Ant clean and compile ​ 修改配置文件，搭建伪分布式系统（可参考文章末第二个链接） 修改/bin/hadoop将最后两个exec改为echo ​ Hadoop客户端调试 运行并记录参数 1./bin/hadoop -jar hadoop-examples-1.2.1.jar wordcount ./conf ./output 参数为-Dproc_-jar……/jsp-api-2.1.jar那一堆 Intellij中Run/Edit Configurations，然后’+’，选application后填写 ​ 修改恢复/bin/hadoop文件，在hdfs中按照configuration配置输入和输出文件的路径 找到RunJar.java在main函数处加断点，调试配置好的configuration ​ ​ Hadoop组件调试 IntelliJ中Edit Configurations，”+”，Remote，并填写端口号。四个组件同理。 ​ 修改/conf/hadoop-env.sh，端口与configuration中一致 ​ 分别找到DataNode，NameNode，TaskTracker，JobTracker的main函数，添加断点 运行Hadoop环境 1./bin/start-all.sh 运行jps指令，四个组件应都显示”main class information unavailable“。 IntelliJ中分别对四个Configuration进行Debug ​ 参考 http://www.techbite.in/2013/05/debug-hadoop-source-code-using.html http://hadoopindepth.blogspot.jp/2014/08/installing-hadoop-121single-node-in.html https://understandbigdata.wordpress.com/2012/12/17/debug-custom-java-hadoop-code-in-local-environment/ ​","categories":[{"name":"环境搭建","slug":"环境搭建","permalink":"http://colink.tech/categories/环境搭建/"}],"tags":[]},{"title":"《How to Read a Book》Notes","slug":"《How-to-Read-a-Book》Notes","date":"2017-04-06T02:45:24.000Z","updated":"2017-04-06T03:01:00.000Z","comments":true,"path":"2017/04/06/《How-to-Read-a-Book》Notes/","link":"","permalink":"http://colink.tech/2017/04/06/《How-to-Read-a-Book》Notes/","excerpt":"","text":"《How to Read a Book》has been on my booklist for a long time. It is a book for those who aims for better reading and better understanding through reading. THE DIMENSIONS OF READING1. The Activity and Art of ReadingReading Actively Like writing, reading is also active like catching the ball. The more active you are reading, the better. Two types of reading: reading for getting information or gaining understanding. The second happens only when: the writer has something better to offer in a clear form (the good book) and it causes the inequality; the reader skillfully overcomes this inequality and approaches the writer. About Learning Two types of learning: learning by instruction or by discovery. Unaided discovery (research) is the art of reading nature and the world; instruction (aided discovery) is the art of reading books or learning from discourse. However, active reading (being enlightened rather than merely being informed) also takes serious thinking, keen observation, range of imagination, analysis and reflection, which are needed in research. Unlike learning from discourse when teachers are present, we must answer the questions ourselves when reading books. 2. Four Levels of ReadingElementary Reading: literacy. Inspectional Reading: understand the surface (main idea, structure) of the book (often within limited time). Analytical Reading: active reading; chewing and digesting; ask many organized questions. Syntopical Reading: construct an analysis of the subject that is not in the series of books. 3. Elementary Reading Four stages to prepare for the first level of reading. High schools and colleges do not provide necessary education that help students go beyond the first level. 4. Inspectional ReadingFirst Part Systematic skimming or pre-reading to see whether the book is worth reading. Six steps: book titles (subtitles) table of contents index blurb pivotal chapters’ summaries epilogue, dipping here and there Second Part Superficial reading. Read the book through to the end unstopped by difficult parts or unfamiliar words while getting the main picture of the intention of the writer. About Reading Speed Read at different speed with different books, different parts of the book and different goals in your mind (inspectional or analytical). Problem of comprehension: speed reading may raise concentration but not comprehension which is obtained only during analytical reading. Every book should be read no more slowly than it deserves, and no more quickly than you can read it with satisfaction and comprehension. Avoid fixations and regressions : eyes frequently fixed on phrases and return to phrases or sentences previously read. 5. How to Be a Demanding ReaderFour Types of Questions Essence of reading (the art of reading) is ask four types of questions and answer them: what is the book about on the whole? (the leading theme and essential subordinate themes or topics) what is being said in detail, and how? (discover the main ideas, assertions and arguments) is the book true, in whole or part? (make up your own mind) what of it? (why does the author thinks it is important, what is further implied and suggested) Making Notes Make a book your own: marking the book, which is the highest respect you pay the author. Use whatever is necessary to mark the book, be it asking questions, summing up the author’s points or emphasis important views and phrases. Use the book’s endpapers wisely and claim the intellectual ownership of the book. Different noting-making during different types of reading: during inspectional reading: structural note-making (what the book is about, the structural order of development) during analytical reading: conceptual note-making (the truth and significance of the book) during synoptical reading: dialectical note-making (concerning several books, order and statements and questions about a single subject) Habit is second nature: learn to read by reading; practice makes perfection; follow the rules. ANALYTICAL READING6. Pigeonholing a Book 1st Rule of Analytical Reading: classify a book as fiction or expository works(theoretical and practical by carefully examining the title, preface and the like. Theoretical v.s. Practical Theoretical is about pure science, while practical is about applied science, which is what we should do. Three types of theoretical: history: a specific time and a specific place, narrative; science: seeks laws or generalizations, experimental and depend on elaborate observational researches; philosophy: seeks general truths. Science v.s. Philosophy science: the books talks about or refers to activities beyond normal or routine daily experience philosophy: normal experience shared by everyone 7. X-raying a Book 2nd Rule of Analytical Reading: state the unity (the theme or main point) of the whole book in a single sentence, or at most a few sentences. capture the essence of the plot; make use of the title and the preface; in expository works, the unity would usually appear in the first paragraph; for history and fiction, the unity would be a single thread of plot. 3rd Rule of Analytical Reading: set forth the major parts of the book, and show how these are organized into a whole, by being ordered to one another and to the unity of the whole. Do not have to follow the rule of creating a similar tree structure of the book; do not strictly follow the author’s outline. But do make your own outline; and look beneath the author’s outline (prefaces, table of contents) to discover the real structure. The third rule shows how and why of your statement of unity, which is not supported without the third rule. 4th Rule of Analytical Reading: find out what the author’s problems (intention) were. figure out the problems the book is trying to solve; list the answers in an intelligible order and answer them; The four rules constitute the first stage of analytical reading. It helps reveal the book’s structure and answer the first type of question: what is the book about on the whole? 8. Coming to Terms with an Author 5th Rule of Analytical Reading: find the important words and through them come to terms (reach an agreement) with the author. deal with the language take a step beyond the language to the thought that lies behind it. this is almost exclusive to expository works, since poetry tends to to ambiguous About Terms Define term: the basic element of communicable knowledge; a word used unambiguously; a skilled use of words for the sake of communicating knowledge. Every field of knowledge has its own technical vocabulary. Discover the meaning of the word you do not understand by using the meanings of all the other words in the context that you do understand. 9. Determining an Author’s Message The two processes, outlining and interpretation meet at the level of propositions and arguments; 6th Rule of Analytical Reading: mark the most important sentences in a book and discover the propositions (conclusions and reasons of an argument) they contain. 7th Rule of Analytical Reading: locate or construct the basic arguments in a book by finding them in the connection of sentences. 8th Rule of Analytical Reading: find out what the author’s solutions are, what problems are left unsolved and what new problems has been raised. Reading Sentences Language &lt; — &gt; Thought/Knowledge (this relationship is not one-to-one) as in: Setences (grammatical units) &lt; – &gt; Propositions (logic units) Vocabulary &lt; – &gt; Terminology (last chapter) Types of sentences: interrogative (ask questions) declarative (answer questions, which are potentially propositions) express wishes and intentions, indicate the author’s purposes One grammatically simple sentence may contains several propositions. Finding the most important sentences: the most important sentences are usually those that cause you extra efforts in understanding. To be perplexed and know it is essential to reading; pay attention to the sentences with special graphical format or style; those composed with important terms; the premises and conclusions of the main argument; distinguish between those interest you and those puzzle you. Discover the propositions: state the proposition in your own words refer to a specific instance as the general proposition states (either imaginatively or actually) The heart of communication lies in the major affirmations and denials he is making, and the reasons he gives for so doing. About Arguments Find the argument: good books with summaries that list important arguments. some arguments lack (key) propositions. Construct the argument: as for reasoning units, find conclusions when you see reasons and find reasons when you discover conclusions. discriminate between inductive (from particular facts to generalization) and deductive (from general statements to further generalization) arguments what the author assumes (that can be proved) and those are self-evident. Two types of self-evident propositions instructive (add to knowledge, e.g. the whole is greater than the part) not instructive (the propositions is contained in the definition of the words, e.g. the father of the father is grandfather) The above 4 rules comprises the second stage of Analytical Reading. It covers interpretation, from words to propositions and arguments, of the book. It also helps answer the second type of question: what is being said in detail, and how? 10. Criticizing a Book Fairly 9th Rule of Analytical Reading: you must be able to say, with reasonable certainty, “I understand”, before you can say any one of the following things: “I agree,” or “I disgree,” or “I suspend judgement.” 10th Rule of Analytical Reading: when you disagree, do so reasonably, and not disputatiously or contentiously. 11th Rule of Analytical Reading: respect the difference between knowledge and mere personal opinion, by giving reasons for any critical judgements you make. Matters of knowledge are generally remediable. About Critizing The activity of reading books does not end with understanding. It must be complete by the work of criticism, the work of judging. Criticism is based on understanding the contents and knowing the rules for criticizing; Where understanding is not present, affirmations and denials are equally meanless and unintelligible. The role of rhetoric is the end. Grammatical and logical skills are means to this end. Criticism always comes after the first two stages of analytical reading has been completed. Opinions v.s. Knowledge: mere (personal) opinions: unsupported judgement; knowledge: consists in those opinions that can be defended. 11. Agreeing or Disagreeing with an Author For a controversy to be well conducted, the are three conditions to be satisfied: recognize that you are being rational instead of emotional recognize what your prejudgement (assumptions) are; good controversy should not be a quarrel about assumptions. read sympathetically and walk in the other’s shoes The above conditions are too ideal to be meeted, these four points are more practical: the author is uninformed: the author lacks knowledge that is relevant to the problem; point out the knowledge and show how it makes a difference the author is misinformed: make assertions contrary to facts the author ise illogical; his reasoning is not congent: commit a fallacy in reasoning; two types of fallacy; first, the conclusion does not follow from the reasons; second, two aspects are incompatible the author’s analysis is incomplete: he has not solved the problems he started with, or he did not make a good use of the materials as possible The 9th, 10th, 11th and the above four points comprise the third stage of analytical reading. It covers critizing a book as a communication of knowledge. The 9th, 10th, 11th rule disscuss the general maxims of intellectual etiquette, and the four points discuss special criteria for points of criticism. This stage helps you answer the third and the fourth questions: is it true? What of it? 12. Aids to ReadingTypes of Aids Only after you have done your best to read a book according to the rules of intrinsic reading, and when it still remains unintelligible to you, you can seek the following four types of outside help: relevant experiences other books commentaries and abstracts reference books Experiences Use relevant experiences as an aid; give a concrete example of a point based on your experience; two types of experiences: common experiences; those shared by most people special experiences; possessed by only those with experiment experience Other BooksRead other books in relation to the book you are reading; read the books in an order in which one book renders another (read what the author has read). This applies better to books on history and philosophy. Commentaries and AbstractsIf use commentaries, use sparingly, as they may be wrong or not exhaustive enough. Read commentaries and handbooks only after intrinsic reading. Reference Books When using reference books, you need four types of knowledge, otherwise reference will be no good: know what you want to know as if ask the book an intelligible question know the types of the reference books and ask the questions that it can answer know how to use it; read the preface and introduction of the reference you must know that it is considered knowledgable Dictionaries, in general, records not only the meanings of words, but also a wealth of historical information of the growth and development of words that is much more important. APPROACHES TO DIFFERENT KINDS OF READING MATTER13. How to Read Practical BooksAbout Practical Books Practical books does not solve particular problems. Only action does. Two types of practical books: one that is primarily presentation of rules: it recommends something that is worth doing; one that is concerned about principles that generate rules: it seems similar to a theoritical book, but the readers should think about practical applications whenever they encounter principles. Reading the Practical Books When judging a practical book for its practical truth, everything turns on the ends or goals. Even though the means provided by the book is the soundest, we have no practical interest if we disapprove or do not care the ends. Two typs questions to ask when reading practical books: what are the author’s objectives? what means for achieving them is he proposing? Be aware of the oratory and propaganda of practical books, but do not be 100% resistant. Know the author’s history, background and character when reading a practical book. Evaluation of Reading Adaptation of the four types of questions: what he wanted you to do; how he proposes that you do this; is what he wants and how he manages to do it the same with yours; do accordingly if you say yes to the third question (in a obligatory sense) 14. How to Read Imaginative LiteratureDifferences that Leads to Don’ts Differences between fictions and expository works: intentions; the expository works mainly intend to convey knowledge whereas fictions mainly tries to communicate an experience itself; language used in fictions tend to be more ambiguous and metaphors are used as units of construction; the fictions teach by creating experience that could have happened. Don’ts of reading fictions: don’t try to resist the effect that a work of imaginative literature has on you; when reading expository works, we should be alert as a bird of prey; don’t look for terms, propositions and arguments in imaginative literature; don’t critize fiction by the standards of truth and consistency that properly apply to communication of knowledge. Rules Adapted for Reading Fictions Rules for reading fictions—structure: classify an imaginative literature according to its kind; grasp the unity of the work, which is always in the plot; summarise the plot in a brief narration; find out the steps that develop the plot; know where it begins, goes through the climax and how it develops in the aftermath. Rules for reading fictions—interpretation: be acquainted with details of incident and characterization: episodes, incidents and characters along with their thoughts, speeches, feelings and actions; just like the terms for expository works; become at home in the imaginary world; follow throught the adventures and unravel the plot. Rules for reading fictions—critics: do not critize imaginative writing until you fully appreciate what the author has tried to make you experience; we do not agree or disagree; we only like it or not; all about the beauty; objectify your reactioins by pointing to things in the book that caused them; know why you like or dislike. 15. Suggestions for Reading Stories, Plays and Poems Imaginative writing may lead to action, but they do not have to. If you are compelled, ask yourself what statements buried in the writing has caused your feeling. How to read stories: read quickly and with total immersion, to keep track of the unity of plot; do not panic about the huge number of names or different incidents; be careful to distinguish the books that satisfy our particular unconscious needs from those that satisfy the deep unconscious needs of everybody, which are great stories. How to read plays: direct the play and pretend to put it on a stage after you have good understanding of the play; read the puzzling passages out loud, slowly and with expression; not all plays are meant to be read; most of them are meant to be acted. How to read lyric poetry: read it through without stopping and try to comprehend the unity; read it through again and read it out loud; ask questions about rhetoric and syntactic; look for conflicts like love and time; do not be keen on learning about the background or the author; return to the poems from time to time; 16. How to Read HistoryGeneral Rules for History History is elusive. General rules: Every history is written from some point of view. To get the truth, we need to look at it from more that one viewpoint. Read a history not only to learn what really happened at a particular time and place in the past, but to learn the way men act in all times and places, especially now. Questions to ask: know what limitations the author set for himself; know what the book is about and is not about; know the exact way the author chooses to tell the “story”; judge the history work after we have understand and decide whether the author lacks verisimilitude or the author is misinformed; what of it; what should be done and what should be avoided; Reading Biography and Current Events Three types of biography: definitive; final and exhaustive and scholar; authorized; somewhat twisted and biased; some in between; Reading current events: know who is writing the report; what does the author want to prove; Whom does he want to convince; what special knowledge does he assume; what special language does he use; does he really know what he is talking about; is he informed enough; 17. How to Read Science and MathematicsAbout Scientific Works Contemporary scientific works tend to care less about lay readers. Characteristics of scientific works: authors usually frankly confess the initial bias; the propositions are general, indicating how things generally behave; the aim is to decribe the phenomenon as accurately and to trace the interconnections; Reading Scientific and Mathematical Works Rules for analytical reading are particular relevant to works in science and mathematics. Why read scientific classics: become aware of the problems the great scientists were trying to solve; be aware of the background of the problem; understand the history and philosphy of science. Difficulties of reading scientific works: readers have to find out the basis for the evidence which sometimes is absent, and readers have to acquire first-hand experience of the experiments and observations; leanring mathematics as a new language needs elementary reading; need skipping sometimes. 18. How to Read PhilosophyPhilosophical Questions The great philosophical books ask the same sort of profound questions the children ask. Two types of philosophical questions: theoretical and speculative: concerned with being or becoming; what is or happens; practical or more precisely normative: what ought to be done or sought. About Philosophy Types of philosophy: concerned with being: metaphysical concerned with becoming: the physical of nature; concerned with knowledge: epistemology; concerned with conduct of individual: ethics; concerned with conduct of individual in relation to the community: political philosophy. Modern and traditional philosophy: answer the first-order questions: concerned with what is or happens or what ought to be done; (traditional, for lay readers) answer the second-order questions: concerned with the content of our thinking when we answer the first-order questions and the ways we express such thoughts in language. (modern, for experts) Philosophical method: involve little experiments but thinking is not enough without experience; we share common experience with great philosophers; they think more profoundly about the experience than the rest of us. Philosophical styles: the philosophical dialsgues; only Plato managed this style; the philosophical treatise on essay; through straightforward exposition; Aristotle and Kant; the meeting of objections; debate and discussion; Thomas Aquinas; the systemization of philosophy; give philosophy certainty and strictly formal structure as of mathematics; the aphoristic style; unsatisfactory from a philosophical view. How to Read Philosophy We must be childishly simple in our questions and maturely wise in our answers. Hints for reading philosophy: be careful for the unstated controlling principles that philosophical works do not explicitly state; they may be stated in related works or in a rather implicit way. Also be careful that the author may not adhere to his stated principles; distinguish between abstract and concrete expressions; refer to the common experience the author mentions and focus on thinking; read more than one philosophical book about one subject; answer the questions for yourself; when reading theology (natural and dogmatic), especially dogmatic theology, for non-believers, accept the first principles as true before reading on; 19. How to Read Social Science The scope of soial science: core: anthropology, economics, politics, sociology; other: law, education, public administration, business, social service and psychology. Difficulties of reading social science: being prevented from analytically reading by your own views of the issue; though some terms are usually present in social articles, you, or even the authors, do not know the exact scope of such terms; few books of social science have “stipulation on usage”, which is common in hard science works, such as mathematics and physical; social science works usually come as a mixed kind of expository writing; they may be a mixture of a large scope of areas including science, history, philosophy and fiction; the mixture shifts between books or even within books; there is not a great book on a single subject of social science, so there is an urgent need to read multiple books on a single subject. THE ULTIMATE GOALS OF READING20. Syntopical ReadingGeneral Ideas The knowledge about the subject does not precede reading but follow reading. The aim of syntopical reading: to solve your own problem, not to get the best of the author’s purpose of writing it; you are the master of the situation. Before Syntopical Reading Find a subject and create a bibliography on the subject. Inspect all of the books on your list before reading any one of them analytically: gives your a clear enough idea about the subject; decides whether the books says something important about the subject and allows you to cut down your bibliography to a managable size, which needs analytical reading; analytical reading applies to a single book. Syntopical Reading Five steps of syntopical reading: find the relevant passages; could be done while doing inspectional reading after you have read mant books, which gives you a clear idea of the subject; bring the authors to terms; force an author to use neutral terminology; avoid being lost in the variety of terms; syntopical reading is an exercise of translation; getting the question clear; establish a set of neutral propositions; the authors can be interpreted as giving answers to these quetions; frame a set of questions in an order; 1st question deals with the existence or character of phenomenon we are investigating, further questoins deals with how the phenomenon is known or how the idea manifest itself, final questions deals with the consequences of the answers to these questoins; defining the issues; to join the different answers; ranging the authors’ answers to various questions on one side of an issue or another; when the issue is not the author’s primary concern, it should be constructed; analyzing the discussion; the truth is probably in the conflict of opposing answers; ask the question in an order and defend that order; ordering the questions and issues by putting the more general ones on the front. Some Tips: Try to achieve dialectical objectivity: look at all sides and to take no sides, constantly refer back to the actual text of the authors. Syntopicon can help readers read initiatively, suggestively and instructively. 21. Reading and the Growth of the Mind Read books beyond you; reading for amusement and information makes no improvement on understanding. Keep looking for those few great books (that are great for you) for the growth of the mind.","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://colink.tech/categories/读书笔记/"}],"tags":[]},{"title":"《硅谷之谜》笔记","slug":"《硅谷之迷》笔记","date":"2017-02-27T03:17:21.000Z","updated":"2017-03-04T11:34:04.000Z","comments":true,"path":"2017/02/27/《硅谷之迷》笔记/","link":"","permalink":"http://colink.tech/2017/02/27/《硅谷之迷》笔记/","excerpt":"","text":"已经读过吴军博士写的几本书，开了眼界。这本《硅谷之谜》算是《浪潮之巅》的续集，探讨了硅谷之所以为硅谷的深层次原因。决定把书中有意思的东西记录下来。 硅谷的文化 冒险者精神——狼性 旧金山地区一直以来是冒险者的圣地。从19世纪的淘金热，再到20世纪迅速发展起来的风险投资，以及硅谷一直以来特有的“叛逆精神”以及“对叛逆的包容”，硅谷的冒险家们续写了硅谷的传奇。 追求各族群平等 旧金山地区最初是西班牙殖民地（很多地名为西班牙语）,再到后来的非洲，欧洲移民，以及现在的亚洲移民。多文化的起源促生了平等对待各族群的要求，硅谷也产生了特有的移民文化。 强调个人奋斗的保守主义 从个人角度来讲， 强调通过个人奋斗提高社会地位，最大化个人利益，淡化集体利益，遇到困难时靠自己的努力走出困境，而不是求助政府；从企业的角度来讲，政府与企业之间仅存在税收的关系（况且公司的税收不是在一个地方缴纳的，所以当地政府拿不到多少税收，反而是一些大公司如Google，Apple会帮助改善当地的基础设施），这也说明了硅谷的公司对政府没有什么依赖。 DIY的思维方式 强调很强的动手能力，这也是区分硅谷工程师与其他工程师的因素。 硅谷风险投资方式——由KPCB和红杉确立 广收薄种 双倍砸钱 ——对于第一轮投资表现好的在下一轮加倍投资 技术价值投资 硅谷的起源和发展 起源 天时：在半导体行业兴起时IBM准备在西海岸建立研发基地 地利：斯坦福大学有土地 人和：“八叛徒” 从肖克利手下叛逃，创立了仙童公司（其实是人不和） 事实上，看似巧合的起源也有其必然。首先，远离传统工业区，西海岸的自由的环境更适合IBM的研发；斯坦福大学在没有经费的情况下设法自救，开放了科技园；诺伊斯以及摩尔等人跟随肖克利来到加州也是因为西海岸脱离了传统工业的限制和束缚。 硅谷1.0 对应第二轮淘金热，白色的金——半导体硅。主要是仙童公司以及其派生出来的公司，如英特尔等。英特尔也成为了世界上最大的半导体公司。英特尔一开始以DRAM为主业，后来一次偶然机遇开始了通用CPU的开发，便有了后来著名的x86系列。这一时期硅谷叛逆之风开始兴起，虽然仙童在创始人离开之后开始衰退，没有能够成为像IBM一样的巨无霸，但是它对硅谷的半导体行业的兴起起到了决定性作用。 硅谷2.0 对应了软件和互联网时代。最初软件的价值需要通过硬件来实现，软件都是搭配硬件免费提供给用户的。而Oracle打破了这一禁锢，将软件的使用权直接卖给使用者，最终成为了最大的数据库软件公司。Oracle也实现了对现有产业的颠覆，与IBM不同，Oracle直接走上了关系型数据库的道路。由于硬件成本逐渐降低，计算机走入家庭成为可能，这就更加促使了个人软件的发展。这里要提到的是软件的崛起和对包括软件在内的知识产权的保护有很大关系，美国是盗版软件最少的，而发展中国家一般都在60%以上。这一阶段也包括了互联网的崛起，思科、网景和雅虎的发展以及本阶段最后21世纪初的互联网泡沫。 硅谷3.0 互联网泡沫之后，硅谷重新涌现出一批明星公司，如Facebook，Google等。其中Facebook也开启了互联网2.0时代。后互联网行业的高速发展速度也对创业公司提出了新的要求，与已知的“大且强”的公司不同，创业公司在这个阶段需要做到“小，快，灵”。对与创业者来说需要做到两点，首先是需要有真正创新的想法和过硬的技术，第二点就是用最短的时间将这个想法实现。 硅谷的奥秘 叛逆和对叛逆的宽容 与东北部的科技公司和大学不同，硅谷的公司以及大学对利用职位资源研发出成果，并用此成果开始创业更加包容。同时，硅谷的公司更偏向于鼓励员工进行创业并给予必要的投资，这样以后也可以更方便的并购。另外一个原因是，硅谷更鼓励站在巨人的肩膀上做“N+1”，而不是另起炉灶从头开始，或者做抄袭之类的“N-1” 多元文化 很多公司一开始做产品时就已经把市场定位在全球。即要做到internationalization （i18n）而非localization（i10n）。Google公司的特点是一款产品在推出英文版的6个月内就推出其他主要语言版本。硅谷本身以移民为主，所以在最初的产品的确定上就有比较好的把握。 拒绝平庸 对于企业来说，卓越是生存的必要条件，也正有了生存竞争硅谷才能保持长青。对于个人而言，硅谷的较高生存成本也决定了必将有残酷的淘汰，也是对人才的一种筛选。 对失败的宽容 创业本身就很难，失败是常有的事。与其他地区看重失败本身不同，硅谷地区更看重创业者本身的努力以及抗压能力。只要创业者信守承诺，尽了最大的努力，以后再次获得投资的可能性比第一次还大。硅谷人常用的方法是试错（Try and error），有了投资人以及公司对失败的宽容，创业者能够更好的发挥创造力。即对失败的宽容也是对大胆创新的鼓励。 工程师文化 工程师地位高：社会地位比较高，有很高的收入；在公司的地位比较高，工程师有话语权。 DIY：“遇山开道，遇水搭桥”。对新技术有非常强的好奇心，自己动手实现想法。Android就是Andy（Andr）自己鼓捣小东西（oid）开发出来的。在硅谷，即使是功成名就的泰斗和巨头都还在自己写程序。硅谷的产品经理和工程师的比例极低，这也依靠了工程师善于自己动脑解决问题的特点。 工程师的五层境界（不同等级的工程师之间的贡献以及价值可能相差数量级）： 第五等：独立完成任务 第四等：领导产品，将产品负责到底。 第三等：做出行业里最好的产品 第二等：做出改变世界的产品 第一等：开创一个行业 不迷信权威 科学是一个方法，一个过程，而不是一个结论。一个结论的正确，不能看谁得出来的，而要看它是怎么得到的。专业的不一定是对的，专业的也不一定能比非专业的做的更好。硅谷的公司更看重你做了什么，而不是你的职位高低。同时，要敢于做前人没有做过的事情，要有闯劲。 扁平式管理 特征是汇报层级少，分权，限制上级对下级的人事权。从本质上来讲，扁平式管理是一种契约精神，类似于婚姻。人与人之间是相对平等的，几乎所有员工的福利是相同的。 世界的情怀 为世界创造出伟大发明的三类人：梦想者，企业家和投资人，工程师。 工业时代的科学基础 机械思维促进人类文化进步牛顿开创了科学的时代，机械思维促使了第一次和第二次工业革命，在极大地提升人均GDP的同时使得人类的寿命翻了一番： 用机械的思维方式解决问题：用理性的眼光对待已知和未知。 发展出了对规律的确定性描述：与玻尔提出的不确定性相对。 科学难题并创造优秀的工业产品：瓦特的改良蒸汽机，史蒂芬森的火车。 促进了产品生产的标准化：泰勒管理理论。 泰勒管理理论 效率优先：优化流程，标准化。产生了大规模流水生产线。 同构的树状组织结构：各个部门交流少，资源浪费。 人性化管理：“积极性加刺激性”，零和游戏时矛盾凸显。 可预测性：根本上是机械思维的特点。 现代工业企业管理制度 资本至关重要 生产资料（和市场）起决定性作用 人和企业：人隶属于企业，企业是主动的。 人和人：企业的纵向层级结构和横向的部门分割结构明确了人与人之间管理和被管理的关系。 分配制度：根本上是零和游戏。虽然早期资方在零和游戏中占优，但是劳工一方通过工会逐渐成为强势的一方。例如，如今的美国汽车行业已经被汽车工会的福利开销搞垮。 专利制度：大工业时期确定。在信息时代出现了难以用专利保护发明以及难以确定专利受益者的问题。专利保护的是一个过程（包括一种实现方法）和一个结果。某一种算法或者原理不能申请专利。 信息时代的科学基础 三论——控制论，信息论，系统论 控制论：由维纳提出。不断根据反馈进行调整和优化。与机械思维指导下生产的可准确预测的工业产品不同，信息时代的互联网产品需要不断对市场和需求的变化进行改变。 信息论：由香农提出。最大熵原理，信源编码（香农第一定律），信道编码（香农第二定律）。霍夫曼编码衍生出资源配置的方案，以及不断对信道的拓宽。 系统论：由贝塔朗菲提出。系统性能未必能通过改进局部进行优化 从预测到反应 强调通过不断根据技术发展和市场变化进行资源的再分配 风险投资两个原则：不做事先假定或预测（鸡蛋不放在一个篮子里），把最多资源投给最可能成功的项目。 信息时代人的特点 现代管理大师德鲁克提出知识工作者本身是自觉的自我管理者，促成了自下而上的管理特色。 从拥有到入口 硅谷的公司对固定资产的需求或者依赖性很小 更看重网络效应和入口效应 网络效应指的是整个生态链中最有价值的关键点，入口效应对应于用户的入口和信息的流通量（香农第二定律）。 从局部到整体 地区对大公司的依赖 一方面由于它们的规模太大了，不允许新的公司竞争市场。另一方面即使大公司开始走下坡路，各种利益集团也想法设法维持大公司的生存。 产业里最好的公司很难走出这个产业 根本上是追求局部最优的结果，而硅谷地区的企业通过先进的技术和管理方式能够达到全局最优。 再议硅谷的奥秘 硅谷公司对失败的宽容。一件事的成功与否很难预测，而对于事情发展的反应更加重要，即控制论中根据反馈不断进行调整。同时，在任务开始之前就要把失败的成本计算进去。 给员工发放期权。期权分配的是未来业绩的增量而不是财富的存量，也使得员工和公司之间建立了契约关系。 扁平式管理。实质上是增加了公司内部沟通的带宽，将组织结构由树状转变为网状。 工程师文化。首先是资本和生产资料的地位下降，而创造力往往决定了成功与否。同时工程师也被当做是基层的管理者。 不迷信权威。信息时代的不确定性太大。 拒绝平庸。与霍夫曼编码一样，最好的资源一定留给最有价值的人和公司。 大数据思维 本质是信息论。 改变了以往先知道原因再推出结果的方式，通过完备的数据直接得到结论。 互联网思维 本质也是信息论。 人与人之间沟通的带宽得到极大的提高。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://colink.tech/categories/读书笔记/"}],"tags":[]},{"title":"打算扎根Github Pages + Hexo了","slug":"Github-pages-hexo","date":"2017-02-23T12:44:54.000Z","updated":"2017-02-24T08:02:36.000Z","comments":true,"path":"2017/02/23/Github-pages-hexo/","link":"","permalink":"http://colink.tech/2017/02/23/Github-pages-hexo/","excerpt":"","text":"最一开始是阿里云vps+typecho，上面也写了些东西。后来没想到那么快阿里云就到期了，上面的东西也没有搬下来。想了想还是自己的锅…… 最近发现GitHub Pages是个好东西，于是就鼓捣了一下。虽然jekyll是原配，但是觉得Hexo更适合我这种懒人。 一直觉得自己没什么写作的动力，毕竟是写作渣渣。但是不写点什么感觉时间过得太快了，所以还是写点什么吧。","categories":[{"name":"其它","slug":"其它","permalink":"http://colink.tech/categories/其它/"}],"tags":[]}]}